{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Permute", "config": {"trainable": true, "dims": [2, 3, 1], "name": "permute_1", "dtype": "float32", "batch_input_shape": [null, 4, 84, 84]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "strides": [4, 4], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_size": [8, 8], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_2", "strides": [2, 2], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "bias_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "units": 512, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "units": 9, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "linear"}}], "keras_version": "2.1.4"}